; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l14_p14_c14_g14)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 medicina)
	(at-box box9 deposito)
	(box-has box9 medicina)
	(at-box box10 deposito)
	(box-has box10 medicina)
	(at-box box11 deposito)
	(box-has box11 medicina)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-person person1 refugio12)
	(at-person person2 refugio9)
	(at-person person3 refugio14)
	(at-person person4 refugio12)
	(at-person person5 refugio2)
	(at-person person6 refugio6)
	(at-person person7 refugio14)
	(at-person person8 refugio13)
	(at-person person9 refugio3)
	(at-person person10 refugio7)
	(at-person person11 refugio2)
	(at-person person12 refugio1)
	(at-person person13 refugio4)
	(at-person person14 refugio7)
)

(:goal (and
	(person-has person2 medicina)
	(person-has person3 comida)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person8 comida)
	(person-has person9 medicina)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person11 comida)
	(person-has person12 comida)
	(person-has person12 medicina)
	(person-has person13 medicina)
	(person-has person14 medicina)
))
)

; plan
1. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 0 of 14
2. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 0 of 14
3. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 0 of 14
4. (leave box14 refugio9 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 medicina)
   added: (at-box box14 refugio9) (free dron1-izq) (person-has person2 medicina)
   goals met: 1 of 14
5. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 1 of 14
6. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 1 of 14
7. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 1 of 14
8. (leave box7 refugio14 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio14) (free dron1-der) (person-has person3 comida)
   goals met: 2 of 14
9. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 2 of 14
10. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 2 of 14
11. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 2 of 14
12. (leave box6 refugio6 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio6) (free dron1-der) (person-has person6 comida)
   goals met: 3 of 14
13. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 3 of 14
14. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 3 of 14
15. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 3 of 14
16. (leave box5 refugio13 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio13) (free dron1-der) (person-has person8 comida)
   goals met: 4 of 14
17. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 4 of 14
18. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 4 of 14
19. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 4 of 14
20. (leave box13 refugio3 dron1-izq dron1 person9 medicina)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 medicina)
   added: (at-box box13 refugio3) (free dron1-izq) (person-has person9 medicina)
   goals met: 5 of 14
21. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 5 of 14
22. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 5 of 14
23. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 5 of 14
24. (move refugio2 refugio4 dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 refugio4)
   goals met: 5 of 14
25. (leave box12 refugio4 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 medicina)
   added: (at-box box12 refugio4) (free dron1-izq) (person-has person13 medicina)
   goals met: 6 of 14
26. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 6 of 14
27. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 6 of 14
28. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 6 of 14
29. (leave box4 refugio2 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio2) (free dron1-der) (person-has person5 comida)
   goals met: 7 of 14
30. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 7 of 14
31. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 7 of 14
32. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 7 of 14
33. (leave box11 refugio2 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 medicina)
   added: (at-box box11 refugio2) (free dron1-izq) (person-has person5 medicina)
   goals met: 8 of 14
34. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 8 of 14
35. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 8 of 14
36. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 8 of 14
37. (leave box3 refugio2 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio2) (free dron1-der) (person-has person11 comida)
   goals met: 9 of 14
38. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 9 of 14
39. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 9 of 14
40. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 9 of 14
41. (leave box2 refugio1 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio1) (free dron1-der) (person-has person12 comida)
   goals met: 10 of 14
42. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 10 of 14
43. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 10 of 14
44. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 10 of 14
45. (move refugio1 refugio7 dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 refugio7)
   goals met: 10 of 14
46. (leave box1 refugio7 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio7) (free dron1-der) (person-has person10 comida)
   goals met: 11 of 14
47. (move refugio7 refugio1 dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 refugio1)
   goals met: 11 of 14
48. (leave box10 refugio1 dron1-izq dron1 person12 medicina)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 medicina)
   added: (at-box box10 refugio1) (free dron1-izq) (person-has person12 medicina)
   goals met: 12 of 14
49. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 12 of 14
50. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 12 of 14
51. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 12 of 14
52. (leave box9 refugio7 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 medicina)
   added: (at-box box9 refugio7) (free dron1-der) (person-has person10 medicina)
   goals met: 13 of 14
53. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 13 of 14
54. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 13 of 14
55. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 13 of 14
56. (leave box8 refugio7 dron1-der dron1 person14 medicina)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 medicina)
   added: (at-box box8 refugio7) (free dron1-der) (person-has person14 medicina)
   goals met: 14 of 14
